
%% ============================16rpm================================
load('F:\文件中转站\Seafile\私人资料库\15所项目\转向机退化与性能试验实验数据2021-02-01\转向机第一次实验数据\转向机第一次性能试验数据\zxj_700_6000_16rpm_1');
x_16_1 = zxj_700_6000_16rpm_1(301:900,2);
load('F:\文件中转站\Seafile\私人资料库\15所项目\转向机退化与性能试验实验数据2021-02-01\转向机第一次实验数据\转向机第一次性能试验数据\zxj_700_6000_16rpm_2');
x_16_2 = zxj_700_6000_16rpm_2(301:900,2);
y_16_1 = spline(1:600,x_16_1,linspace(1,600,1440));
y_16_2 = spline(1:600,x_16_2,linspace(1,600,1440));


%% ============================24rpm================================
load('F:\文件中转站\Seafile\私人资料库\15所项目\转向机退化与性能试验实验数据2021-02-01\转向机第一次实验数据\转向机第一次性能试验数据\zxj_700_6000_24rpm_1');
x_24_1 = zxj_700_6000_24rpm_1(281:700,2);
load('F:\文件中转站\Seafile\私人资料库\15所项目\转向机退化与性能试验实验数据2021-02-01\转向机第一次实验数据\转向机第一次性能试验数据\zxj_700_6000_24rpm_2');
x_24_2 = zxj_700_6000_24rpm_2(281:700,2);
y_24_1 = spline(1:420,x_24_1,linspace(1,420,1440));
y_24_2 = spline(1:420,x_24_2,linspace(1,420,1440));

y = [y_16_1; y_16_2; y_24_1; y_24_2];
save('data_16_24prm.mat','y');